
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第一个Docker化的Java应用 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="../" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="第一个Docker化的Java应用.html">
            
                <a href="第一个Docker化的Java应用.html">
            
                    
                    第一个Docker化的Java应用
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >第一个Docker化的Java应用</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p>&#x3010;&#x7B2C;&#x4E00;&#x4E2A;Docker&#x5316;&#x7684;Java&#x5E94;&#x7528;&#x3011;
&#x5FEB;&#x901F;&#x7684;&#x6301;&#x7EED;&#x96C6;&#x6210;&#xFF0C;&#x670D;&#x52A1;&#x7684;&#x5F39;&#x6027;&#x4F38;&#x7F29;&#x7B49;&#xFF0C;&#x90E8;&#x7F72;&#x7B80;&#x5355;&#xFF0C;&#x89E3;&#x653E;&#x8FD0;&#x7EF4;&#xFF0C;&#x8282;&#x7701;&#x673A;&#x5668;&#x8D44;&#x6E90;&#x3002;2015&#x5E74;618&#x6708;&#x4EAC;&#x4E1C;&#x6709;15&#x4E07;&#x4E2A;Docker&#x5B9E;&#x4F8B;&#xFF0C;&#x5E76;&#x4E14;&#x6240;&#x6709;&#x5B9E;&#x4F8B;&#x5168;&#x90E8;Docker&#x5316;&#x3002;</p>
<p>&#x3010;Docker&#x7B80;&#x5355;&#x8BA4;&#x8BC6;&#x3011;
Docker id the world&apos;s leading software containerization platform.&#x6258;&#x7BA1;&#x5728;github&#x4E0A;&#x3002;&#x8DE8;&#x5E73;&#x53F0;&#xFF0C;&#x652F;&#x6301;Windows&#x3001;Macos&#x3001;Linux&#x3002;
Docker&#x662F;&#x4E00;&#x4E2A;&#x7528;&#x6765;&#x88C5;&#x5E94;&#x7528;&#x7684;&#x5BB9;&#x5668;&#xFF0C;&#x5C31;&#x50CF;&#x676F;&#x5B50;&#x53EF;&#x4EE5;&#x88C5;&#x6C34;&#xFF0C;&#x7B14;&#x7B52;&#x53EF;&#x4EE5;&#x653E;&#x7B14;&#xFF0C;&#x4E66;&#x5305;&#x53EF;&#x4EE5;&#x653E;&#x4E66;&#x4E00;&#x6837;&#xFF0C;&#x53EF;&#x4EE5;&#x628A;&#x4EFB;&#x4F55;&#x60F3;&#x5F97;&#x5230;&#x7684;&#x7A0B;&#x5E8F;&#x653E;&#x5230;docker&#x91CC;&#x3002;
Docker&#x5B98;&#x7F51;&#xFF1A;www.docker.com</p>
<p>Docker&#x5F88;&#x591A;&#x547D;&#x4EE4;&#x90FD;&#x8DDF;Git&#x76F8;&#x4F3C;&#x3002;</p>
<p>&#x3010;&#x7406;&#x89E3;Docker&#x3011;
Docker&#x601D;&#x60F3;&#xFF1A;
    &#xB7;&#x96C6;&#x88C5;&#x7BB1;
    &#xB7;&#x6807;&#x51C6;&#x5316;&#xFF1A;&#x8FD0;&#x8F93;&#x65B9;&#x5F0F;&#x3001;&#x5B58;&#x50A8;&#x65B9;&#x5F0F;&#xFF08;&#x4E0D;&#x9700;&#x5173;&#x5FC3;&#x5E94;&#x7528;&#x5B58;&#x5728;&#x4EC0;&#x4E48;&#x5730;&#x65B9;&#xFF09;&#x3001;API&#x63A5;&#x53E3;&#xFF08;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x7CFB;&#x5217;&#x7684;REST API&#x63A5;&#x53E3;&#xFF09;&#x3002;
    &#xB7;&#x9694;&#x79BB;&#xFF1A;&#x7C7B;&#x4F3C;&#x4E8E;&#x865A;&#x62DF;&#x673A;&#xFF0C;&#x4F46;&#x662F;&#x66F4;&#x8F7B;&#x91CF;&#x3002;&#x53EF;&#x5B9E;&#x73B0;&#x5FEB;&#x901F;&#x521B;&#x5EFA;&#x548C;&#x9500;&#x6BC1;&#xFF0C;&#x6700;&#x5E95;&#x5C42;&#x7684;&#x6280;&#x672F;&#x5B9E;&#x9645;&#x4E0A;&#x662F;Linux&#x7684;&#x4E00;&#x79CD;&#x5185;&#x6838;&#x9650;&#x5236;&#x673A;&#x5236;LXC&#x3002;
            LXC&#x662F;&#x4E00;&#x79CD;&#x8F7B;&#x91CF;&#x7EA7;&#x7684;&#x5BB9;&#x5668;&#x865A;&#x62DF;&#x5316;&#x6280;&#x672F;&#xFF0C;&#x6700;&#x5927;&#x6548;&#x7387;&#x7684;&#x9694;&#x79BB;&#x4E86;&#x8FDB;&#x7A0B;&#x548C;&#x8D44;&#x6E90;&#xFF0C;&#x901A;&#x8FC7;cgroup&#x3001;namespace&#x7684;&#x9650;&#x5236;&#xFF0C;&#x9694;&#x79BB;&#x8FDB;&#x7A0B;&#x7EC4;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x7269;&#x7406;&#x8D44;&#x6E90;&#xFF0C;&#x6BD4;&#x5982;cpu\memory\io&#x7B49;&#x7B49;&#x3002;</p>
<p>Docker&#x51FA;&#x73B0;&#x89E3;&#x51B3;&#x4E86;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF1F;
    &#x4E00;&#x4E2A;Java Web&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#x9700;&#x8981;&#x4F9D;&#x8D56;&#x7684;&#x6709;&#xFF1A;&#x6700;&#x5E95;&#x5C42;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3001;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E0A;&#x4F9D;&#x8D56;JDK&#x3001;tomcat&#x3001;&#x4EE3;&#x7801;&#x3001;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x3002;
    docker&#x628A;&#x6240;&#x6709;&#x4F9D;&#x8D56;&#x7684;&#x4E1C;&#x897F;&#x90FD;&#x653E;&#x5230;&#x96C6;&#x88C5;&#x7BB1;&#x91CC;&#xFF0C;&#x518D;&#x6253;&#x5305;&#x653E;&#x5230;&#x9CB8;&#x9C7C;&#x4E0A;&#xFF0C;&#x7531;&#x9CB8;&#x9C7C;&#x7ED9;&#x9001;&#x5230;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#xFF0C;&#x5728;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x8FD0;&#x884C;&#x3002;</p>
<pre><code>&#x5171;&#x7528;&#x670D;&#x52A1;&#x5668;&#x95EE;&#x9898;&#xFF0C;&#x4F1A;&#x51FA;&#x73B0;&#x7A0B;&#x5E8F;&#x6302;&#x6389;&#xFF0C;&#x4E0D;&#x662F;&#x5185;&#x5B58;&#x6EE1;&#x4E86;&#x5C31;&#x662F;&#x786C;&#x76D8;&#x6EE1;&#x4E86;&#x3002;&#x6216;&#x8005;&#x53D1;&#x73B0;&#x67D0;&#x4E2A;&#x670D;&#x52A1;&#x53D8;&#x6162;&#x4E86;&#xFF0C;&#x751A;&#x81F3;&#x6572;&#x7EC8;&#x7AEF;&#x90FD;&#x975E;&#x5E38;&#x5361;&#xFF0C;&#x53EF;Linux&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x591A;&#x79DF;&#x6237;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x53EF;&#x4EE5;&#x4F9B;&#x591A;&#x7528;&#x6237;&#x540C;&#x65F6;&#x4F7F;&#x7528;&#xFF0C;&#x600E;&#x4E48;&#x529E;&#x5462;&#xFF1F;--Docker&#x7684;&#x9694;&#x79BB;&#x6027;&#x5B8C;&#x5168;&#x89E3;&#x51B3;&#x4E86;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;
&#x628A;&#x5927;&#x5BB6;&#x7A0B;&#x5E8F;&#x90FD;&#x653E;&#x5728;Docker&#x91CC;&#x8FD0;&#x884C;&#xFF0C;&#x5C31;&#x7B97;&#x522B;&#x4EBA;&#x7684;&#x7A0B;&#x5E8F;&#x8FD8;&#x662F;&#x6B7B;&#x5FAA;&#x73AF;&#xFF0C;&#x75AF;&#x72C2;&#x5403;CPU&#x6216;&#x8005;&#x6253;&#x65E5;&#x5FD7;&#x5360;&#x6EE1;&#x78C1;&#x76D8;&#x6216;&#x8005;&#x5360;&#x7528;&#x5927;&#x91CF;&#x5185;&#x5B58;&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#xFF0C;&#x90FD;&#x4E0D;&#x4F1A;&#x5BFC;&#x81F4;&#x522B;&#x4EBA;&#x7684;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x9519;&#x8BEF;&#xFF0C;&#x53EA;&#x4F1A;&#x5BFC;&#x81F4;&#x81EA;&#x5DF1;&#x7684;&#x7A0B;&#x5E8F;&#x3002;
&#x56E0;&#x4E3A;Docker&#x5728;&#x542F;&#x52A8;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x7ED9;&#x5B83;&#x9650;&#x5B9A;&#x597D;&#x4E86;&#x6700;&#x5927;&#x4F7F;&#x7528;&#x7684;CPU&#x3001;&#x5185;&#x5B58;&#x3001;&#x786C;&#x76D8;&#xFF0C;&#x5982;&#x679C;&#x8D85;&#x8FC7;&#x4E86;&#x4F60;&#x5C31;&#x4F1A;&#x88AB;&#x6740;&#x6389;&#x3002;

&#x4E1A;&#x52A1;&#x91CF;&#x5E76;&#x4E0D;&#x662F;&#x5E73;&#x5747;&#x7684;&#xFF0C;&#x9700;&#x8981;&#x6309;&#x9700;&#x4F38;&#x7F29;&#x8282;&#x70B9;&#x3002;&#x4F7F;&#x7528;Docker&#x80FD;&#x77AC;&#x95F4;&#x6269;&#x589E;&#x51E0;&#x5341;&#x751A;&#x81F3;&#x51E0;&#x767E;&#x53F0;&#x670D;&#x52A1;&#x5668;&#x51FA;&#x6765;&#x3002;

1.Docker&#x89E3;&#x51B3;&#x4E86;&#x8FD0;&#x884C;&#x73AF;&#x5883;&#x4E0D;&#x4E00;&#x81F4;&#x6240;&#x5E26;&#x6765;&#x7684;&#x95EE;&#x9898;&#x3002;
2.&#x89E3;&#x51B3;&#x4E86;&#x670D;&#x52A1;&#x5668;&#x5171;&#x7528;&#x5E26;&#x6765;&#x7684;&#x8D44;&#x6E90;&#x4F7F;&#x7528;&#x95EE;&#x9898;&#x3002;
3.Docker&#x7684;&#x6807;&#x51C6;&#x5316;&#x8BA9;&#x5FEB;&#x901F;&#x6269;&#x5C55;&#x3001;&#x5F39;&#x6027;&#x4F38;&#x7F29;&#x53D8;&#x5F97;&#x7B80;&#x5355;&#x3002;
</code></pre><p>&#x3010;&#x8D70;&#x8FDB;Docker&#x3011;</p>
<h5 id="docker&#x6838;&#x5FC3;&#x6280;&#x672F;&#xFF1A;&#x955C;&#x50CF;&#x3001;&#x4ED3;&#x5E93;&#x3001;&#x5BB9;&#x5668;">Docker&#x6838;&#x5FC3;&#x6280;&#x672F;&#xFF1A;&#x955C;&#x50CF;&#x3001;&#x4ED3;&#x5E93;&#x3001;&#x5BB9;&#x5668;</h5>
<p>&#x6838;&#x5FC3;&#x5C31;&#x662F;&#xFF1A;&#x6784;&#x5EFA;&#x955C;&#x50CF;&#x3001;&#x8FD0;&#x884C;&#x5BB9;&#x5668;&#xFF0C;&#x955C;&#x50CF;&#x901A;&#x8FC7;&#x4ED3;&#x5E93;&#x6765;&#x4F20;&#x8F93;&#x3002;
Docker&#x96C6;&#x88C5;&#x7BB1;&#x7684;&#x601D;&#x60F3;&#xFF1A;&#x4F53;&#x73B0;&#x5728;&#x955C;&#x50CF;&#x4E0A;&#xFF0C;&#x96C6;&#x88C5;&#x7BB1;&#x662F;&#x5206;&#x5C42;&#x7684;&#xFF0C;&#x6BCF;&#x4E00;&#x5C42;&#x7684;&#x4E1C;&#x897F;&#x90FD;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#xFF0C;&#x4E00;&#x4E2A;&#x955C;&#x50CF;&#x6253;&#x597D;&#x540E;&#x5C31;&#x597D;&#x50CF;&#x4E00;&#x4E2A;&#x5927;&#x5927;&#x7684;&#x96C6;&#x88C5;&#x7BB1;&#xFF0C;&#x5B83;&#x91CC;&#x9762;&#x7684;&#x4E1C;&#x897F;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x3002;
Docker&#x6807;&#x51C6;&#x5316;&#x601D;&#x60F3;&#xFF1A;&#x542F;&#x52A8;&#x3001;&#x4E0B;&#x8F7D;&#x3001;&#x8FD0;&#x884C;&#x955C;&#x50CF;&#x7684;&#x65B9;&#x5F0F;&#x90FD;&#x4F1A;&#x53D1;&#x73B0;&#x6240;&#x505A;&#x7684;&#x64CD;&#x4F5C;&#x90FD;&#x662F;&#x57FA;&#x672C;&#x5DEE;&#x4E0D;&#x591A;&#x7684;&#x3002;
Docker&#x9694;&#x79BB;&#x601D;&#x60F3;&#xFF1A;&#x7F51;&#x7EDC;&#x7684;&#x9694;&#x79BB;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x7684;&#x9694;&#x79BB;&#x3001;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x78C1;&#x76D8;&#x7684;&#x9694;&#x79BB;&#x3002;&#x8BA9;&#x5BB9;&#x5668;&#x8FD0;&#x884C;&#x8D77;&#x6765;&#x4F1A;&#x62E5;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x8FDB;&#x7A0B;&#x7A7A;&#x95F4;&#xFF0C;&#x5E76;&#x4E14;&#x4ED6;&#x8FD8;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x78C1;&#x76D8;&#x3001;&#x7F51;&#x7EDC;&#xFF0C;&#x56E0;&#x4E3A;&#x5BB9;&#x5668;&#x5185;&#x7684;&#x7F51;&#x7EDC;&#x5916;&#x9762;&#x662F;&#x8BBF;&#x95EE;&#x4E0D;&#x5230;&#x7684;&#x3002;</p>
<p>1.Build&#xFF08;&#x955C;&#x50CF;--&#x96C6;&#x88C5;&#x7BB1;&#xFF09;                ----&#x6784;&#x5EFA;&#x955C;&#x50CF;&#xFF08;&#x76EE;&#x7684;&#x662F;&#x5728;&#x5176;&#x4ED6;&#x673A;&#x5668;&#x3001;&#x73AF;&#x5883;&#x8FD0;&#x884C;&#x7A0B;&#x5E8F;&#xFF09;
2.Ship&#xFF08;&#x4ED3;&#x5E93;--&#x8D85;&#x7EA7;&#x7801;&#x5934;&#xFF09;            ----&#x8FD0;&#x8F93;&#x955C;&#x50CF;
3.Run&#xFF08;&#x5BB9;&#x5668;--&#x8FD0;&#x884C;&#x7A0B;&#x5E8F;&#x7684;&#x5730;&#x65B9;&#xFF09;        ----&#x8FD0;&#x884C;&#x7684;&#x955C;&#x50CF;
&#x7528;Docker&#x8FD0;&#x884C;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x7684;&#x8FC7;&#x7A0B;&#xFF1A;&#x53BB;&#x4ED3;&#x5E93;&#x628A;&#x955C;&#x50CF;&#x62C9;&#x5012;&#x672C;&#x5730;&#xFF0C;&#x7136;&#x540E;&#x7528;&#x4E00;&#x6761;&#x547D;&#x4EE4;&#x628A;&#x955C;&#x50CF;&#x8FD0;&#x884C;&#x8D77;&#x6765;&#x53D8;&#x6210;&#x5BB9;&#x5668;&#x3002;</p>
<h5 id="docker&#x955C;&#x50CF;">Docker&#x955C;&#x50CF;</h5>
<p>&#x955C;&#x50CF;&#xFF08;image&#xFF09;&#xFF0C;&#x9CB8;&#x9C7C;&#x9A6E;&#x7740;&#x7684;&#x6240;&#x6709;&#x96C6;&#x88C5;&#x7BB1;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x955C;&#x50CF;&#x3002;&#x672C;&#x8D28;&#x4E0A;&#x8BB2;&#xFF0C;&#x5176;&#x5B9E;&#x955C;&#x50CF;&#x5C31;&#x662F;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x53EF;&#x4EE5;&#x5305;&#x62EC;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5305;&#x62EC;&#x5E94;&#x7528;&#x7684;&#x8FD0;&#x884C;&#x73AF;&#x5883;&#x7684;&#x6587;&#x4EF6;&#x3002;
&#x65E2;&#x7136;&#x90FD;&#x662F;&#x6587;&#x4EF6;&#xFF0C;Docker&#x80AF;&#x5B9A;&#x628A;&#x5B83;&#x4FDD;&#x5B58;&#x5728;&#x4E86;&#x672C;&#x5730;&#x3002;&#x90A3;&#x662F;&#x4EE5;&#x4EC0;&#x4E48;&#x683C;&#x5F0F;&#x4FDD;&#x5B58;&#x7684;&#x5462;&#xFF1F;&#x6D89;&#x53CA;&#x5230;Linux&#x7684;&#x5B58;&#x50A8;&#x6280;&#x672F;&#x53EB;&#x505A;&#x8054;&#x5408;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;UnionFS&#xFF0C;&#x4ED6;&#x662F;&#x4E00;&#x79CD;&#x5206;&#x5C42;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x4E0D;&#x540C;&#x7684;&#x76EE;&#x5F55;&#x6302;&#x5230;&#x540C;&#x4E00;&#x4E2A;&#x865A;&#x62DF;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E0B;&#x3002;
Docker&#x955C;&#x50CF;&#x6B63;&#x662F;&#x5229;&#x7528;&#x4E86;Linux&#x7684;&#x5206;&#x5C42;&#x6982;&#x5FF5;&#x6765;&#x5B9E;&#x73B0;&#x7684;&#x955C;&#x50CF;&#x5B58;&#x50A8;&#x3002;
Docker&#x955C;&#x50CF;&#x6BCF;&#x4E00;&#x5C42;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x90FD;&#x662F;&#x53EA;&#x8BFB;&#x7684;&#xFF0C;&#x628A;&#x6BCF;&#x4E00;&#x5C42;&#x52A0;&#x8F7D;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#xFF0C;&#x8FD9;&#x4E9B;&#x6587;&#x4EF6;&#x90FD;&#x4F1A;&#x88AB;&#x770B;&#x505A;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x76EE;&#x5F55;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x3002;Docker&#x7684;&#x8FD9;&#x79CD;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x5C31;&#x88AB;&#x79F0;&#x4F5C;&#x955C;&#x50CF;&#x3002;</p>
<h5 id="docker&#x5BB9;&#x5668;">Docker&#x5BB9;&#x5668;</h5>
<p>&#x5BB9;&#x5668;&#x7684;&#x672C;&#x8D28;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x3002;&#x4E3A;&#x4E86;&#x4FBF;&#x4E8E;&#x7406;&#x89E3;&#xFF0C;&#x53EF;&#x4EE5;&#x5148;&#x628A;&#x5BB9;&#x5668;&#x60F3;&#x8C61;&#x6210;&#x4E00;&#x4E2A;&#x865A;&#x62DF;&#x673A;&#x3002;
&#x6BCF;&#x4E2A;&#x865A;&#x62DF;&#x673A;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x628A;Docker&#x955C;&#x50CF;&#x770B;&#x505A;&#x662F;Docker&#x5BB9;&#x5668;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x3002;
Docker&#x5BB9;&#x5668;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E0E;&#x865A;&#x62DF;&#x673A;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x533A;&#x522B;&#x5728;&#x4E8E;&#xFF1A;
    Docker&#x5BB9;&#x5668;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x662F;&#x4E00;&#x5C42;&#x5C42;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x6700;&#x4E0B;&#x9762;&#x7684;N&#x5C42;&#x90FD;&#x662F;&#x53EA;&#x8BFB;&#x7684;&#xFF0C;&#x53EA;&#x6709;&#x6700;&#x4E0A;&#x9762;&#x4E00;&#x5C42;&#x662F;&#x53EF;&#x5199;&#x7684;&#x3002;
        &#xB7;&#x5F53;&#x5927;&#x5BB6;&#x7684;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x8D77;&#x6765;&#xFF0C;&#x52BF;&#x5FC5;&#x8981;&#x5199;&#x4E00;&#x4E9B;&#x65E5;&#x5FD7;&#xFF0C;&#x5199;&#x4E00;&#x4E9B;&#x6587;&#x4EF6;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x5BF9;&#x7CFB;&#x7EDF;&#x7684;&#x67D0;&#x4E00;&#x4E9B;&#x6587;&#x4EF6;&#x505A;&#x4E00;&#x4E9B;&#x4FEE;&#x6539;&#xFF0C;&#x6240;&#x4EE5;&#x5BB9;&#x5668;&#x5728;&#x6700;&#x4E0A;&#x9762;&#x4E00;&#x5C42;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x53EF;&#x8BFB;&#x53EF;&#x5199;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x3002;<br>        &#xB7;&#x7A0B;&#x5E8F;&#x5728;&#x8FD0;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x5982;&#x679C;&#x53BB;&#x5199;&#x4E00;&#x4E2A;&#x955C;&#x50CF;&#x4E2D;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x56E0;&#x955C;&#x50CF;&#x7684;&#x6BCF;&#x4E00;&#x5C42;&#x90FD;&#x662F;&#x53EA;&#x8BFB;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x4F1A;&#x5728;&#x5199;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x4E4B;&#x524D;&#x628A;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x8FD9;&#x4E00;&#x5C42;&#x8003;&#x5230;&#x5BB9;&#x5668;&#x7684;&#x6700;&#x4E0A;&#x5C42;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x5BF9;&#x5B83;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#x3002;
    &#x4FEE;&#x6539;&#x540E;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x7684;&#x5E94;&#x7528;&#x8BFB;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B83;&#x4F1A;&#x4ECE;&#x6700;&#x9876;&#x5C42;&#x5F00;&#x59CB;&#x67E5;&#x627E;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x624D;&#x4F1A;&#x627E;&#x4E0B;&#x4E00;&#x5C42;&#x3002;</p>
<pre><code>&#x7531;&#x4E8E;&#x5BB9;&#x5668;&#x7684;&#x8FD9;&#x4E00;&#x5C42;&#x662F;&#x53EF;&#x4EE5;&#x4FEE;&#x6539;&#x7684;&#xFF0C;&#x800C;&#x955C;&#x50CF;&#x662F;&#x4E0D;&#x53EF;&#x4EE5;&#x4FEE;&#x6539;&#x7684;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#xFF1A;&#x540C;&#x4E00;&#x4E2A;&#x955C;&#x50CF;&#x53EF;&#x4EE5;&#x751F;&#x6210;&#x591A;&#x4E2A;&#x5BB9;&#x5668;&#x72EC;&#x7ACB;&#x8FD0;&#x884C;&#xFF0C;&#x800C;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x7684;&#x5E72;&#x6270;&#x3002;
</code></pre><h5 id="docker&#x4ED3;&#x5E93;">Docker&#x4ED3;&#x5E93;</h5>
<p>&#x6784;&#x5EFA;&#x955C;&#x50CF;&#x7684;&#x76EE;&#x7684;&#x662F;&#x628A;&#x4ED6;&#x4F20;&#x9012;&#x5230;&#x5176;&#x4ED6;&#x673A;&#x5668;&#x3001;&#x73AF;&#x5883;&#x53BB;&#x8FD0;&#x884C;&#x3002;
&#x4F20;&#x8F93;&#x8FC7;&#x7A0B;&#x5219;&#x4F7F;&#x7528;&#x5230;&#x4E86;Docker&#x4ED3;&#x5E93;&#xFF0C;&#x8981;&#x5148;&#x628A;Docker&#x955C;&#x50CF;&#x4F20;&#x5230;Docker&#x4ED3;&#x5E93;&#x4E2D;&#xFF0C;&#x518D;&#x7531;&#x76EE;&#x7684;&#x5730;&#x53BB;Docker&#x4ED3;&#x5E93;&#x628A;Docker&#x955C;&#x50CF;&#x62C9;&#x8FC7;&#x53BB;&#xFF0C;&#x8FD9;&#x5C31;&#x5B8C;&#x6210;&#x4E86;&#x4F20;&#x8F93;&#x8FC7;&#x7A0B;&#x3002;
Docker&#x4ED3;&#x5E93;&#x80AF;&#x5B9A;&#x4F1A;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x4E2D;&#x592E;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x7ED9;&#x4E00;&#x4E2A;&#x5730;&#x5740;&#x53BB;&#x8BBF;&#x95EE;&#x5B83;&#x3002;
Docker&#x81EA;&#x5DF1;hub.docker.com&#x63D0;&#x4F9B;&#x4E86;Docker&#x4ED3;&#x5E93;&#x670D;&#x52A1;&#x3002;&#x4F46;&#x5176;&#x4E0B;&#x8F7D;&#x955C;&#x50CF;&#x5F88;&#x6162;&#xFF0C;&#x56FD;&#x5185;&#x4E5F;&#x5728;&#x505A;&#x81EA;&#x5DF1;&#x7684;&#x4ED3;&#x5E93;&#xFF0C;&#x6BD4;&#x8F83;&#x77E5;&#x540D;&#x7684;&#x6709;c.163.com&#xFF08;&#x7F51;&#x6613;&#x8702;&#x5DE2;&#x7684;&#x955C;&#x50CF;&#x4E2D;&#x5FC3;&#xFF09;.
&#x5982;&#x679C;&#x955C;&#x50CF;&#x6BD4;&#x8F83;&#x79C1;&#x5BC6;&#xFF0C;Docker&#x4E5F;&#x652F;&#x6301;&#x81EA;&#x5DF1;&#x642D;&#x5EFA;&#x955C;&#x50CF;&#x4E2D;&#x5FC3;&#x3002;</p>
<p>&#x3010;Docker Windows&#x5B89;&#x88C5;&#x3011;
1.&#x5B89;&#x88C5;DockerToolbox
&#x53CC;&#x51FB;&#x5B89;&#x88C5;&#x5305;-Next-&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x5B89;&#x88C5;&#x4F4D;&#x7F6E;&#xFF0C;&#x70B9;&#x51FB;Next-&#x9ED8;&#x8BA4;&#x5B89;&#x88C5;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;-&#x70B9;&#x51FB;&#x59CB;&#x7EC8;&#x4FE1;&#x4EFB;oracle&#x7684;&#x5B89;&#x88C5;&#x3002;
2.&#x5B89;&#x88C5;&#x540E;&#xFF0C;&#x70B9;&#x51FB;Docker Quickstart Terminal&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x8FD0;&#x884C;&#x65F6;&#x95F4;&#x4F1A;&#x957F;&#x4E00;&#x70B9;&#x3002;
&#x5B83;&#x4F1A;&#x53BB;&#x627E;boot2docker.iso&#x3002;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x628A;&#x4E0B;&#x8F7D;&#x597D;&#x7684;boot2docker.iso&#x62F7;&#x8D1D;&#x5230;&#x7528;&#x6237;&#x7684;&#x6839;&#x76EE;&#x5F55;(&#x5982;)C:\Users\jianghongyu.GIS.docker\machine\cache&#x4E0B;&#xFF0C;&#x4E5F;&#x5373;&#x547D;&#x4EE4;&#x884C;&#x63D0;&#x793A;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x5F55;&#x3002;
&#x518D;&#x6B21;&#x70B9;&#x51FB;Docker Quickstart Terminal&#x3002;
3.&#x68C0;&#x6D4B;&#x5B89;&#x88C5;&#x3002;
&#x5728;&#x5B89;&#x88C5;&#x8FC7;docker&#x7684;&#x7EC8;&#x7AEF;&#x8F93;&#x5165;docker version&#x3002;&#x5982;&#x679C;&#x80FD;&#x663E;&#x793A;Client&#x3001;Server&#x7684;&#x4FE1;&#x606F;&#x5219;&#x8868;&#x793A;&#x5B89;&#x88C5;&#x6210;&#x529F;&#x3002;</p>
<p>&#x3010;Docker Linux&#x5B89;&#x88C5;&#x3011;
Docker&#x672C;&#x8EAB;&#x5728;Ubuntu&#x7CFB;&#x7EDF;&#x4E0A;&#x5F00;&#x53D1;&#x7684;&#xFF0C;&#x5BF9;&#x5176;&#x652F;&#x6301;&#x6700;&#x597D;
Linux&#x7CFB;&#x7EDF;&#x7684;&#x53D1;&#x884C;&#x7248;&#x672C;&#x6BD4;&#x8F83;&#x591A;&#x3002;
    &#xB7;Redhat&amp;CentOS&#xFF08;&#x540C;&#x6E90;&#xFF09;&#xFF1A;&#x7CFB;&#x7EDF;&#x8981;&#x6C42;&#xFF1A;64-bit OS and version 3.10&#xFF08;&#x5185;&#x6838;&#x7248;&#x672C;&#xFF09;&#x53C2;&#x8003;www.imooc.com/article/16448
    &#xB7;Ubuntu&#xFF1A;&#x7CFB;&#x7EDF;&#x8981;&#x6C42;&#xFF1A;64-bit OS and version 3.10&#xFF08;&#x5185;&#x6838;&#x7248;&#x672C;&#xFF09;
Linux&#x5185;&#x6838;&#x9700;&#x5728;3.10&#x4EE5;&#x4E0A;&#x3002;</p>
<p>&#x3010;Docker&#x5B9E;&#x8DF5;&#x90E8;&#x5206;&#x3011;</p>
<h5 id="&#x7B2C;&#x4E00;&#x4E2A;docker&#x955C;&#x50CF;helloworld">&#x7B2C;&#x4E00;&#x4E2A;docker&#x955C;&#x50CF;helloworld</h5>
<p>[&#x4E0B;&#x8F7D;]
&#xB7;docker pull [OPTIONS] NAME[:TAG]                &#x4ECE;docker&#x8FDC;&#x7A0B;&#x4ED3;&#x5E93;&#x62C9;&#x53D6;&#x4E00;&#x4E2A;&#x955C;&#x50CF;&#x5230;&#x672C;&#x5730;&#xFF0C;NAME&#x8868;&#x793A;&#x8981;&#x62C9;&#x53D6;&#x7684;&#x955C;&#x50CF;&#x7684;&#x540D;&#x79F0;&#xFF0C;TAG&#x53EF;&#x9009;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x52A0;&#x4F1A;&#x9ED8;&#x8BA4;&#x52A0;&#x4E0A;:latest&#x8868;&#x793A;&#x6700;&#x65B0;&#x7248;&#x672C;&#x3002;OPTIONS&#x662F;&#x62C9;&#x53D6;&#x7684;&#x4E00;&#x4E9B;&#x53C2;&#x6570;&#x3002;
&#xB7;docker images [OPTIONS] [REPOSITORY[:TAG]]        &#x67E5;&#x770B;&#x672C;&#x673A;&#x6709;&#x54EA;&#x4E9B;&#x955C;&#x50CF;&#xFF0C;&#x4E5F;&#x53EF;&#x9A8C;&#x8BC1;pull&#x662F;&#x5426;&#x6210;&#x529F;&#x4E86;&#x3002;&#x6307;&#x5B9A;&#x955C;&#x50CF;&#x7684;&#x540D;&#x79F0;&#x548C;&#x7248;&#x672C;&#x3002;
[&#x8FD0;&#x884C;]
&#xB7;docker run [OPTIONS] IMAGE[:TAG] [COMMAND] [ARG...]    COMMAND&#x8868;&#x793A;&#x955C;&#x50CF;&#x5728;&#x8FD0;&#x884C;&#x8D77;&#x6765;&#x7684;&#x65F6;&#x5019;&#x8981;&#x6267;&#x884C;&#x4EC0;&#x4E48;&#x547D;&#x4EE4;&#xFF0C;ARG&#x8868;&#x793A;&#x547D;&#x4EE4;&#x6240;&#x9700;&#x7684;&#x53C2;&#x6570;
[&#x4F7F;&#x7528;&#x793A;&#x4F8B;]
    docker images&#x67E5;&#x770B;&#x672C;&#x673A;&#x6240;&#x6709;&#x955C;&#x50CF;&#x5217;&#x8868;&#xFF0C;&#x53D1;&#x73B0;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x955C;&#x50CF;&#xFF0C;&#x53EA;&#x6253;&#x5370;&#x4E86;&#x6BCF;&#x4E00;&#x5217;&#x7684;&#x5217;&#x5934;.&#x5176;&#x4E2D;&#x7684;IMAGE ID&#x662F;&#x4E00;&#x4E2A;64wei&#x5B57;&#x7B26;&#x4E32;&#x53EF;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x955C;&#x50CF;
    docker pull hello-world&#x6CA1;&#x6709;&#x6307;&#x5B9A;&#x7F51;&#x7AD9;&#x53BB;&#x62C9;&#x53D6;&#x955C;&#x50CF;&#xFF0C;&#x4F1A;&#x9ED8;&#x8BA4;&#x5230;Docker&#x63D0;&#x4F9B;&#x7684;docker&#x4ED3;&#x5E93;&#x53BB;&#x628A;&#x955C;&#x50CF;&#x4E0B;&#x8F7D;&#x56DE;&#x6765;&#x3002;
    docker run hello-world&#xFF08;&#x524D;&#x53F0;&#x542F;&#x52A8;&#x4E00;&#x4E2A;&#x955C;&#x50CF;&#xFF09;</p>
<p>&#x3010;Docker&#x8FD0;&#x884C;Nginx Web&#x670D;&#x52A1;&#x5668;&#x3011;</p>
<h5 id="nginx&#x955C;&#x50CF;&#x7684;&#x7279;&#x70B9;">Nginx&#x955C;&#x50CF;&#x7684;&#x7279;&#x70B9;</h5>
<p>&#xB7;&#x6301;&#x4E45;&#x8FD0;&#x884C;&#x7684;&#x5BB9;&#x5668;
&#xB7;&#x524D;&#x53F0;&#x6302;&#x8D77;&amp;&#x540E;&#x53F0;&#x8FD0;&#x884C;   &#x524D;&#x53F0;&#x8FD0;&#x884C;&#x7684;&#x955C;&#x50CF;&#x53EF;&#x4EE5;&#x7528;Ctrl+C&#x7ED3;&#x675F;&#x8FDB;&#x7A0B;&#xFF0C;Nginx&#x6700;&#x597D;&#x4F7F;&#x7528;&#x540E;&#x53F0;&#x8FD0;&#x884C;
&#xB7;&#x8FDB;&#x5165;&#x5BB9;&#x5668;&#x5185;&#x90E8;</p>
<p>&#x53BB;&#x7F51;&#x6613;&#x8702;&#x5DE2;&#x955C;&#x50CF;&#x4E2D;&#x5FC3;&#x67E5;nginx&#x7684;&#x955C;&#x50CF;&#x540D;&#x79F0;&#xFF0C;&#x590D;&#x5236;&#x4E0B;&#x8F7D;&#x5730;&#x5740;
docker pull hub.c.163.com/library/nginx:latest&#x62C9;&#x53D6;&#x955C;&#x50CF;
docker images    &#x67E5;&#x770B;&#x6240;&#x6709;&#x955C;&#x50CF;
docker ps &#x67E5;&#x770B;&#x76EE;&#x524D;&#x6B63;&#x5728;&#x8FD9;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#x8FD0;&#x884C;&#x7684;&#x5BB9;&#x5668;&#x8FDB;&#x7A0B;
docker run --help&#x67E5;&#x770B;&#x53C2;&#x6570;
docker run -d hub.c.163.com/library/nginx&#x540E;&#x53F0;&#x8FD0;&#x884C;&#x5BB9;&#x5668;&#xFF08;&#x53BB;&#x6389;-d&#x53C2;&#x6570;&#x5373;&#x5728;&#x524D;&#x53F0;&#x8FD0;&#x884C;&#x5BB9;&#x5668;&#xFF09;
docker exec --help&#x5728;&#x4E00;&#x4E2A;&#x8FD0;&#x884C;&#x7684;&#x5BB9;&#x5668;&#x4E2D;&#x8FD0;&#x884C;&#x4E00;&#x4E2A;&#x547D;&#x4EE4;
docker exec -it f4 bash &#x5206;&#x914D;&#x4E00;&#x4E2A;&#x4F2A;&#x7EC8;&#x7AEF;&#xFF0C;&#x6211;&#x4EEC;&#x624D;&#x56DE;&#x53BB;&#x8F93;&#x5165;&#x6211;&#x4EEC;&#x7684;&#x5185;&#x5BB9;(&#x6307;&#x5B9A;&#x5BB9;&#x5668;&#x7684;id&#x6216;&#x8005;&#x540D;&#x5B57;)
    &#x8FDB;&#x53BB;&#x540E;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;ls,which nginx,ps -ef&#x67E5;&#x770B;&#x5F53;&#x524D;&#x670D;&#x52A1;&#x90FD;&#x6709;&#x54EA;&#x4E9B;&#x8FDB;&#x7A0B;,exit</p>
<p>&#x3010;Docker&#x7F51;&#x7EDC;---&gt;&#x5728;&#x4E3B;&#x673A;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x8BBF;&#x95EE;&#x5230;&#x8FD0;&#x884C;&#x7684;Nginx&#x3011;</p>
<h5 id="&#x7F51;&#x7EDC;&#x7C7B;&#x578B;">&#x7F51;&#x7EDC;&#x7C7B;&#x578B;</h5>
<pre><code>Bridge&#x6865;&#x63A5;
Host
None
</code></pre><p>Docker&#x5177;&#x6709;&#x9694;&#x79BB;&#x6027;&#xFF0C;&#x7F51;&#x7EDC;&#x4E5F;&#x662F;&#x9694;&#x79BB;&#x6027;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;
Linux&#x7528;&#x4E86;namespace&#x5373;&#x547D;&#x540D;&#x7A7A;&#x95F4;&#x6765;&#x8FDB;&#x884C;&#x8D44;&#x6E90;&#x7684;&#x9694;&#x79BB;&#xFF0C;&#x6BD4;&#x5982;PID namespace&#x5C31;&#x662F;&#x7528;&#x6765;&#x9694;&#x79BB;&#x8FDB;&#x7A0B;&#xFF0C;mark namespace&#x5C31;&#x662F;&#x7528;&#x6765;&#x9694;&#x79BB;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#xFF0C;network namespace&#x5C31;&#x662F;&#x7528;&#x6765;&#x9694;&#x79BB;&#x7F51;&#x7EDC;&#x7684;&#x3002;
&#x6BCF;&#x4E00;&#x4E2A;network namespace&#x90FD;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4EFD;&#x72EC;&#x7ACB;&#x7684;&#x7F51;&#x7EDC;&#x73AF;&#x5883;&#xFF0C;&#x5305;&#x62EC;&#x7F51;&#x5361;&#x3001;&#x8DEF;&#x7531;&#x3001;iptables&#x89C4;&#x5219;&#x7B49;&#x7B49;&#x3002;
&#xB7;Docker&#x5BB9;&#x5668;&#x4E00;&#x822C;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#x56DE;&#x5206;&#x914D;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;namespace&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x7F51;&#x7EDC;&#x7C7B;&#x578B;&#x4E2D;&#x7684;bridge&#x6A21;&#x5F0F;&#x3002;
&#xB7;&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x7F51;&#x7EDC;&#x7C7B;&#x578B;&#x662F;Host&#x6A21;&#x5F0F;&#xFF0C;&#x5982;&#x679C;&#x542F;&#x52A8;&#x5BB9;&#x5668;&#x65F6;&#x5019;&#x6307;&#x5B9A;&#x4F7F;&#x7528;Host&#x6A21;&#x5F0F;&#xFF0C;&#x90A3;&#x4E48;&#x5BB9;&#x5668;&#x5C06;&#x4E0D;&#x4F1A;&#x83B7;&#x5F97;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;network namespace&#xFF0C;&#x800C;&#x662F;&#x548C;&#x4E3B;&#x673A;&#x5171;&#x540C;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x3002;&#x8FD9;&#x65F6;&#x5BB9;&#x5668;&#x5C06;&#x4E0D;&#x4F1A;&#x518D;&#x865A;&#x62DF;&#x51FA;&#x81EA;&#x5DF1;&#x7684;&#x7F51;&#x5361;&#x3001;&#x914D;&#x7F6E;&#x51FA;&#x81EA;&#x5DF1;&#x7684;IP&#x7B49;&#x3002;&#x800C;&#x662F;&#x4F1A;&#x4F7F;&#x7528;&#x5BBF;&#x4E3B;&#x673A;&#x4E0A;&#x7684;IP&#x548C;&#x7AEF;&#x53E3;&#x3002;
&#xB7;&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x7F51;&#x7EDC;&#x7C7B;&#x578B;&#x662F;&#x6CA1;&#x6709;&#x7F51;&#x7EDC;&#xFF0C;Docker&#x5C06;&#x4E0D;&#x4F1A;&#x8DDF;&#x5916;&#x754C;&#x7684;&#x4EFB;&#x4F55;&#x4E1C;&#x897F;&#x8FDB;&#x884C;&#x901A;&#x8BAF;&#x3002;</p>
<h5 id="&#x7AEF;&#x53E3;&#x6620;&#x5C04;">&#x7AEF;&#x53E3;&#x6620;&#x5C04;</h5>
<p>&#x5F53;&#x4F7F;&#x7528;Bridge&#x6A21;&#x5F0F;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x6D89;&#x53CA;&#x5230;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;&#x65E2;&#x7136;&#x5B83;&#x4F7F;&#x7528;&#x7684;&#x7F51;&#x7EDC;&#x662F;&#x72EC;&#x7ACB;&#x7684;namespace&#xFF0C;&#x8FD9;&#x5C31;&#x9700;&#x8981;&#x4E00;&#x79CD;&#x6280;&#x672F;&#xFF08;&#x7AEF;&#x53E3;&#x6620;&#x5C04;&#xFF09;&#x4F7F;&#x5BB9;&#x5668;&#x4E2D;&#x7684;&#x7AEF;&#x53E3;&#x80FD;&#x591F;&#x5728;&#x5BBF;&#x4E3B;&#x673A;&#x4E0A;&#x8BBF;&#x95EE;&#x5230;&#x3002;
Docker&#x53EF;&#x4EE5;&#x6307;&#x5B9A;&#x4F60;&#x60F3;&#x628A;&#x5BB9;&#x5668;&#x5185;&#x7684;&#x67D0;&#x4E00;&#x4E2A;&#x7AEF;&#x53E3;&#x548C;&#x5BB9;&#x5668;&#x6240;&#x5728;&#x4E3B;&#x673A;&#x4E0A;&#x7684;&#x67D0;&#x4E00;&#x4E2A;&#x7AEF;&#x53E3;&#x4E4B;&#x95F4;&#x8FDB;&#x884C;&#x4E00;&#x4E2A;&#x6620;&#x5C04;&#xFF0C;&#x5F53;&#x4F60;&#x5728;&#x8BBF;&#x95EE;&#x4E3B;&#x673A;&#x4E0A;&#x8FD9;&#x4E2A;&#x7AEF;&#x53E3;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x8BBF;&#x95EE;&#x5BB9;&#x5668;&#x91CC;&#x9762;&#x7684;&#x90A3;&#x4E00;&#x4E2A;&#x7AEF;&#x53E3;&#x3002;</p>
<p>docker&#x9ED8;&#x8BA4;&#x4F7F;&#x7528;bridge&#x6A21;&#x5F0F;&#xFF0C;&#x539F;&#x6765;&#x5728;&#x8BE5;&#x6A21;&#x5F0F;&#x65F6;&#x5E76;&#x6CA1;&#x6709;&#x544A;&#x8BC9;&#x5B83;&#x7AEF;&#x53E3;&#x5982;&#x4F55;&#x6620;&#x5C04;&#xFF0C;&#x6240;&#x4EE5;&#x4E3B;&#x673A;&#x4E0A;&#x8BBF;&#x95EE;&#x4E0D;&#x5230;&#x5BB9;&#x5668;&#x91CC;&#x7684;&#x7AEF;&#x53E3;&#x3002;</p>
<p>docker stop    &#x5BB9;&#x5668;&#x7684;id&#x6216;&#x540D;&#x5B57;                            &#x505C;&#x6B62;&#x6307;&#x5B9A;&#x955C;&#x50CF;
docker run -d -p 8080:80 &#x5BB9;&#x5668;id&#x6216;&#x540D;&#x5B57;                &#x4E3B;&#x673A;&#x7AEF;&#x53E3;:&#x5BB9;&#x5668;&#x7AEF;&#x53E3;
netstat -na|grep 8080                                &#x68C0;&#x6D4B;&#x662F;&#x5426;&#x5F00;&#x653E;&#x4E86;&#x7AEF;&#x53E3;
docker run -d -P hub.c.163.com/library/nginx        &#x5F00;&#x653E;&#x6240;&#x6709;&#x76D1;&#x542C;&#x7AEF;&#x53E3;&#x6620;&#x5C04;&#x5230;&#x4E3B;&#x673A;&#x7684;&#x968F;&#x673A;&#x7AEF;&#x53E3;</p>
<p>&#x3010;&#x5236;&#x4F5C;&#x81EA;&#x5DF1;&#x7684;&#x955C;&#x50CF;&#x3011;
&#x53BB;&#x7F51;&#x6613;163&#x955C;&#x50CF;&#x4E2D;&#x5FC3;&#x627E;&#x4E00;&#x4E2A;tomcat&#x955C;&#x50CF;&#x4F5C;&#x4E3A;&#x6211;&#x4EEC;&#x7684;&#x57FA;&#x7840;&#x955C;&#x50CF;&#x3002;
docker pull hub.c.163.com/library/tomcat:latest        tomcat&#x8FD9;&#x4E2A;&#x955C;&#x50CF;&#x80AF;&#x5B9A;&#x5305;&#x62EC;JDK&#x7684;&#x3002;
[&#x5199;Dockerfile]
vi Dockerfile
from hub.c.163.com/library/tomcat                from &#x57FA;&#x7840;&#x955C;&#x50CF;&#x7684;&#x540D;&#x5B57;--&#x544A;&#x8BC9;docker&#x505A;&#x4E00;&#x4E2A;&#x81EA;&#x5DF1;&#x7684;&#x955C;&#x50CF;&#xFF0C;&#x662F;&#x4EE5;tomcat&#x955C;&#x50CF;&#x4E3A;&#x8D77;&#x70B9;&#x3002;
MAINTAINER jianghy xxx@126.com                    &#x955C;&#x50CF;&#x6240;&#x6709;&#x8005;&#x7684;&#x540D;&#x5B57;
COPY jpress.war /usr/local/tomcat/webapps        &#x628A;web&#x5E94;&#x7528;&#x653E;&#x5230;&#x955C;&#x50CF;&#x91CC;&#x9762;&#xFF0C;&#x6B64;&#x5904;&#x662F;tomcat&#x7684;webapps&#x4E0B;(&#x5177;&#x4F53;&#x8DEF;&#x5F84;&#x67E5;&#x770B;&#x955C;&#x50CF;&#x4E0B;&#x8F7D;&#x9875;&#x9762;&#x4E2D;&#x7684;CATALINA_HOME) COPY &#x672C;&#x5730;&#x6587;&#x4EF6;
docker build -t jpress:latest .                    &#x6784;&#x5EFA;&#x955C;&#x50CF;&#xFF0C;&#x53C2;&#x6570;&#x8DDF;Dockerfile&#x7684;&#x5B58;&#x653E;&#x76EE;&#x5F55;&#xFF0C;&#x5F53;&#x524D;&#x76EE;&#x5F55;&#x662F;&#x4E00;&#x4E2A;&#x70B9;</p>
<p>&#x4FEE;&#x6539;&#x6587;&#x4EF6;&#x7684;&#x540D;&#x5B57; mv old&#x6587;&#x4EF6; new&#x6587;&#x4EF6;</p>
<p>&#x3010;&#x8FD0;&#x884C;&#x81EA;&#x5DF1;&#x7684;&#x5BB9;&#x5668;&#x3011;
docker run -d -p 8888:8080 jpress
docker ps
netstat -na|grep 8888
&#x6D4F;&#x89C8;&#x5668;&#x8BBF;&#x95EE;localhost:8888/jpress</p>
<p>docker&#x7684;-e&#x547D;&#x4EE4;&#x662F;&#x6307;&#x5B9A;&#x73AF;&#x5883;&#x53D8;&#x91CF;
&#x5728;&#x955C;&#x50CF;&#x4E2D;&#x5FC3;&#x641C;&#x7D22;mysql&#x7684;&#x5730;&#x5740;&#xFF0C;&#x4E0B;&#x8F7D;&#x4E0B;&#x6765;MySQL&#x955C;&#x50CF;,&#x542F;&#x52A8;MySQL&#x955C;&#x50CF;&#x5E76;&#x521B;&#x5EFA;MySQL&#x6570;&#x636E;&#x5E93;
docker run -d -p 3306:3306 -e MYSQL_ROOT_PASSWORD=000000 -e MYSQL_DATABASE=jpress hub.c.163.com/library/mysql:latest 
docker ps
netstat -na|grep 3306
&#x542F;&#x52A8;&#x540E;&#x6D4F;&#x89C8;&#x5668;&#x8BBF;&#x95EE;localhost:8888/jpress
&#x5728;JPress&#x5B89;&#x88C5;&#x5411;&#x5BFC;&#x91CC;&#x8FDB;&#x884C;&#x914D;&#x7F6E;
&#x914D;&#x7F6E;&#x3001;&#x5B89;&#x88C5;&#x5B8C;&#x6210;&#x540E;&#x91CD;&#x542F;web&#x670D;&#x52A1;&#x5668;  docker restart &#x5BB9;&#x5668;ID</p>
<p>&#x3010;&#x603B;&#x7ED3;&#x3011;
&#x4E0B;&#x62C9;&#x955C;&#x50CF; 
&#x6784;&#x5EFA;&#x955C;&#x50CF;&#x3001;&#x8FD0;&#x884C;&#x5BB9;&#x5668;&#xFF0C;&#x955C;&#x50CF;&#x901A;&#x8FC7;&#x4ED3;&#x5E93;&#x6765;&#x4F20;&#x8F93;&#x3002;&#x8FD0;&#x884C;&#x5BB9;&#x5668;
&#x505C;&#x6B62;&#x5BB9;&#x5668;
&#x91CD;&#x542F;&#x5BB9;&#x5668;
&#x8FDB;&#x5165;&#x5BB9;&#x5668;&#x5185;&#x90E8;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../" class="navigation navigation-prev navigation-unique" aria-label="Previous page: Introduction">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第一个Docker化的Java应用","level":"1.2","depth":1,"previous":{"title":"Introduction","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"第一个Docker化的Java应用/第一个Docker化的Java应用.md","mtime":"2017-05-31T02:38:45.272Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-02-18T14:43:00.827Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

